In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame([
    ['2022-01-01', 'A', 10, 'rahul'],
    ['2022-01-01', 'B', 20, 'rahul'],
    ['2022-01-01', 'B', 50, 'rahul'],
    ['2022-01-02', 'A', 30, 'rahul'],
    ['2022-01-02', 'B', 40, 'rahul'],
    ['2022-01-02', 'C', 10, 'vidu'],
    ['2022-01-02', 'C', 30, 'vidu'],
    ['2022-01-02', 'C', 30, 'vidu'],
    ['2022-01-03', 'D', 20, 'vidu'],
], columns=['Date', 'Category', 'Qty', 'Customer'])

In [6]:
df

         Date Category  Qty Customer
0  2022-01-01        A   10    rahul
1  2022-01-01        B   20    rahul
2  2022-01-01        B   50    rahul
3  2022-01-02        A   30    rahul
4  2022-01-02        B   40    rahul
5  2022-01-02        C   10     vidu
6  2022-01-02        C   30     vidu
7  2022-01-02        C   30     vidu
8  2022-01-03        D   20     vidu

In [33]:
table = df.pivot_table(values='Qty', index='Date', columns='Category', aggfunc='sum', fill_value=0)
table

Category     A   B   C   D
Date
2022-01-01  10  70   0   0
2022-01-02  30  40  70   0
2022-01-03   0   0   0  20

In [30]:
type(table)
table.index
table.columns
table.values

pandas.core.frame.DataFrame

Index(['2022-01-01', '2022-01-02', '2022-01-03'], dtype='object', name='Date')

Index(['A', 'B', 'C', 'D'], dtype='object', name='Category')

array([[10, 70,  0,  0],
       [30, 40, 70,  0],
       [ 0,  0,  0, 20]])

In [63]:
df.pivot_table(values='Category', index=['Date', 'Customer'], aggfunc='count')

                     Category
Date       Customer
2022-01-01 rahul            3
2022-01-02 rahul            2
           vidu             3
2022-01-03 vidu             1

In [65]:
df.pivot_table(values='Customer', index='Date', aggfunc='count')

            Customer
Date
2022-01-01         3
2022-01-02         5
2022-01-03         1

In [66]:
df.pivot_table(values='Qty', columns='Category', index='Date')

Category       A     B          C     D
Date
2022-01-01  10.0  35.0        NaN   NaN
2022-01-02  30.0  40.0  23.333333   NaN
2022-01-03   NaN   NaN        NaN  20.0

In [45]:
df.pivot_table(values='Category', index=['Date', 'Category'], columns='Customer', aggfunc='count')

Customer             rahul  vidu
Date       Category
2022-01-01 A           1.0   NaN
           B           2.0   NaN
2022-01-02 A           1.0   NaN
           B           1.0   NaN
           C           NaN   3.0
2022-01-03 D           NaN   1.0

In [41]:
df.pivot_table(values='Qty', index=['Customer', 'Category'],
               columns='Date', aggfunc='sum', fill_value=0)

Date               2022-01-01  2022-01-02  2022-01-03
Customer Category
rahul    A                 10          30           0
         B                 70          40           0
vidu     C                  0          70           0
         D                  0           0          20